# Joins in `pyspark`

Performed with `df_left.join(df_right, how=type_str)`

In [1]:
from pyspark.sql import SparkSession
from more_pyspark import to_pandas
spark = SparkSession.builder.appName('Ops').getOrCreate()
deptk = spark.read.csv("./data/department.csv",  header=True, inferSchema=True)
deptk.collect() >> to_pandas

   DeptID     DeptName
0      31        Sales
1      33  Engineering
2      34     Clerical
3      35    Marketing

In [2]:
emplk = spark.read.csv("./data/employee.csv",  header=True, inferSchema=True)
emplk.collect() >> to_pandas

     LastName  DeptID
0    Rafferty    31.0
1       Jones    33.0
2  Heisenberg    33.0
3    Robinson    34.0
4       Smith    34.0
5    Williams     NaN

#### Inner join

In [3]:
(emplk.join(deptk, emplk.DeptID == deptk.DeptID, how='inner')
 .collect()) >> to_pandas

     LastName  DeptID     DeptName
0    Rafferty      31        Sales
1       Jones      33  Engineering
2  Heisenberg      33  Engineering
3    Robinson      34     Clerical
4       Smith      34     Clerical

#### Left join

In [4]:
(emplk.join(deptk, emplk.DeptID == deptk.DeptID, how='left')
 .collect()) >> to_pandas

     LastName  DeptID     DeptName
0    Rafferty    31.0        Sales
1       Jones    33.0  Engineering
2  Heisenberg    33.0  Engineering
3    Robinson    34.0     Clerical
4       Smith    34.0     Clerical
5    Williams     NaN         None

#### Right join

In [5]:
(emplk.join(deptk, emplk.DeptID == deptk.DeptID, how='right')
 .collect()) >> to_pandas

     LastName  DeptID     DeptName
0    Rafferty      31        Sales
1  Heisenberg      33  Engineering
2       Jones      33  Engineering
3       Smith      34     Clerical
4    Robinson      34     Clerical
5        None      35    Marketing

#### Outer join

In [6]:
(emplk.join(deptk, emplk.DeptID == deptk.DeptID, how='outer')
 .collect()) >> to_pandas

     LastName  DeptID     DeptName
0    Rafferty    31.0        Sales
1    Robinson    34.0     Clerical
2       Smith    34.0     Clerical
3    Williams     NaN         None
4        None    35.0    Marketing
5       Jones    33.0  Engineering
6  Heisenberg    33.0  Engineering

## <font color="red"> Exercise 2 </font>

Determine all the players that have hit more than 100 home runs in a season.  The final table should include the players proper name, as well as the team name.  

**Hint:** You will need join the files listed below.  To get credit for this exercise, use the join `pyspark` join methods presented above.

In [7]:
paths = ("./data/baseball/core/Batting.csv", 
         "./data/baseball/core/People.csv",
         "./data/baseball/core/Teams.csv")

In [8]:
# Your code here